MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP512MC806/mcu.h
#define CRCXORL CRCXORL
extern volatile uint16_t CRCXORL __attribute__((__sfr__));
typedef struct tagCRCXORLBITS {
  uint16_t :1;
  uint16_t X1:1;
  uint16_t X2:1;
  uint16_t X3:1;
  uint16_t X4:1;
  uint16_t X5:1;
  uint16_t X6:1;
  uint16_t X7:1;
  uint16_t X8:1;
  uint16_t X9:1;
  uint16_t X10:1;
  uint16_t X11:1;
  uint16_t X12:1;
  uint16_t X13:1;
  uint16_t X14:1;
  uint16_t X15:1;
} CRCXORLBITS;
extern volatile CRCXORLBITS CRCXORLbits __attribute__((__sfr__));

#define CRCXORH CRCXORH
extern volatile uint16_t CRCXORH __attribute__((__sfr__));
typedef struct tagCRCXORHBITS {
  uint16_t X16:1;
  uint16_t X17:1;
  uint16_t X18:1;
  uint16_t X19:1;
  uint16_t X20:1;
  uint16_t X21:1;
  uint16_t X22:1;
  uint16_t X23:1;
  uint16_t X24:1;
  uint16_t X25:1;
  uint16_t X26:1;
  uint16_t X27:1;
  uint16_t X28:1;
  uint16_t X29:1;
  uint16_t X30:1;
  uint16_t X31:1;
} CRCXORHBITS;
extern volatile CRCXORHBITS CRCXORHbits __attribute__((__sfr__));

#define CRCDAT CRCDAT
extern volatile uint16_t CRCDAT __attribute__((__sfr__));
#define CRCDATL CRCDATL
extern volatile uint16_t CRCDATL __attribute__((__sfr__));
#define CRCDATH CRCDATH
extern volatile uint16_t CRCDATH __attribute__((__sfr__));
#define CRCWDAT CRCWDAT
extern volatile uint16_t CRCWDAT __attribute__((__sfr__));
#define CRCWDATL CRCWDATL
extern volatile uint16_t CRCWDATL __attribute__((__sfr__));
#define CRCWDATH CRCWDATH
extern volatile uint16_t CRCWDATH __attribute__((__sfr__));
#define RPOR0 RPOR0
extern volatile uint16_t RPOR0 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR0BITS {
  union {
    struct {
      uint16_t RP64R:6;
      uint16_t :2;
      uint16_t RP65R:6;
    };
    struct {
      uint16_t RP64R0:1;
      uint16_t RP64R1:1;
      uint16_t RP64R2:1;
      uint16_t RP64R3:1;
      uint16_t RP64R4:1;
      uint16_t RP64R5:1;
      uint16_t :2;
      uint16_t RP65R0:1;
      uint16_t RP65R1:1;
      uint16_t RP65R2:1;
      uint16_t RP65R3:1;
      uint16_t RP65R4:1;
      uint16_t RP65R5:1;
    };
  };
} RPOR0BITS;
extern volatile RPOR0BITS RPOR0bits __attribute__((__sfr__));

#define RPOR1 RPOR1
extern volatile uint16_t RPOR1 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR1BITS {
  union {
    struct {
      uint16_t RP66R:6;
      uint16_t :2;
      uint16_t RP67R:6;
    };
    struct {
      uint16_t RP66R0:1;
      uint16_t RP66R1:1;
      uint16_t RP66R2:1;
      uint16_t RP66R3:1;
      uint16_t RP66R4:1;
      uint16_t RP66R5:1;
      uint16_t :2;
      uint16_t RP67R0:1;
      uint16_t RP67R1:1;
      uint16_t RP67R2:1;
      uint16_t RP67R3:1;
      uint16_t RP67R4:1;
      uint16_t RP67R5:1;
    };
  };
} RPOR1BITS;
extern volatile RPOR1BITS RPOR1bits __attribute__((__sfr__));

#define RPOR2 RPOR2
extern volatile uint16_t RPOR2 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR2BITS {
  union {
    struct {
      uint16_t RP68R:6;
      uint16_t :2;
      uint16_t RP69R:6;
    };
    struct {
      uint16_t RP68R0:1;
      uint16_t RP68R1:1;
      uint16_t RP68R2:1;
      uint16_t RP68R3:1;
      uint16_t RP68R4:1;
      uint16_t RP68R5:1;
      uint16_t :2;
      uint16_t RP69R0:1;
      uint16_t RP69R1:1;
      uint16_t RP69R2:1;
      uint16_t RP69R3:1;
      uint16_t RP69R4:1;
      uint16_t RP69R5:1;
    };
  };
} RPOR2BITS;
extern volatile RPOR2BITS RPOR2bits __attribute__((__sfr__));

#define RPOR3 RPOR3
extern volatile uint16_t RPOR3 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR3BITS {
  union {
    struct {
      uint16_t RP70R:6;
      uint16_t :2;
      uint16_t RP71R:6;
    };
    struct {
      uint16_t RP70R0:1;
      uint16_t RP70R1:1;
      uint16_t RP70R2:1;
      uint16_t RP70R3:1;
      uint16_t RP70R4:1;
      uint16_t RP70R5:1;
      uint16_t :2;
      uint16_t RP71R0:1;
      uint16_t RP71R1:1;
      uint16_t RP71R2:1;
      uint16_t RP71R3:1;
      uint16_t RP71R4:1;
      uint16_t RP71R5:1;
    };
  };
} RPOR3BITS;
extern volatile RPOR3BITS RPOR3bits __attribute__((__sfr__));

#define RPOR4 RPOR4
extern volatile uint16_t RPOR4 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR4BITS {
  union {
    struct {
      uint16_t :8;
      uint16_t RP80R:6;
    };
    struct {
      uint16_t :8;
      uint16_t RP80R0:1;
      uint16_t RP80R1:1;
      uint16_t RP80R2:1;
      uint16_t RP80R3:1;
      uint16_t RP80R4:1;
      uint16_t RP80R5:1;
    };
  };
} RPOR4BITS;
extern volatile RPOR4BITS RPOR4bits __attribute__((__sfr__));

#define RPOR5 RPOR5
extern volatile uint16_t RPOR5 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR5BITS {
  union {
    struct {
      uint16_t RP82R:6;
      uint16_t :2;
      uint16_t RP84R:6;
    };
    struct {
      uint16_t RP82R0:1;
      uint16_t RP82R1:1;
      uint16_t RP82R2:1;
      uint16_t RP82R3:1;
      uint16_t RP82R4:1;
      uint16_t RP82R5:1;
      uint16_t :2;
      uint16_t RP84R0:1;
      uint16_t RP84R1:1;
      uint16_t RP84R2:1;
      uint16_t RP84R3:1;
      uint16_t RP84R4:1;
      uint16_t RP84R5:1;
    };
  };
} RPOR5BITS;
extern volatile RPOR5BITS RPOR5bits __attribute__((__sfr__));

#define RPOR6 RPOR6
extern volatile uint16_t RPOR6 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR6BITS {
  union {
    struct {
      uint16_t RP85R:6;
      uint16_t :2;
      uint16_t RP87R:6;
    };
    struct {
      uint16_t RP85R0:1;
      uint16_t RP85R1:1;
      uint16_t RP85R2:1;
      uint16_t RP85R3:1;
      uint16_t RP85R4:1;
      uint16_t RP85R5:1;
      uint16_t :2;
      uint16_t RP87R0:1;
      uint16_t RP87R1:1;
      uint16_t RP87R2:1;
      uint16_t RP87R3:1;
      uint16_t RP87R4:1;
      uint16_t RP87R5:1;
    };
  };
} RPOR6BITS;
extern volatile RPOR6BITS RPOR6bits __attribute__((__sfr__));

#define RPOR7 RPOR7
extern volatile uint16_t RPOR7 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR7BITS {
  union {
    struct {
      uint16_t RP96R:6;
      uint16_t :2;
      uint16_t RP97R:6;
    };
    struct {
      uint16_t RP96R0:1;
      uint16_t RP96R1:1;
      uint16_t RP96R2:1;
      uint16_t RP96R3:1;
      uint16_t RP96R4:1;
      uint16_t RP96R5:1;
      uint16_t :2;
      uint16_t RP97R0:1;
      uint16_t RP97R1:1;
      uint16_t RP97R2:1;
      uint16_t RP97R3:1;
      uint16_t RP97R4:1;
      uint16_t RP97R5:1;
    };
  };
} RPOR7BITS;
extern volatile RPOR7BITS RPOR7bits __attribute__((__sfr__));

#define RPOR8 RPOR8
extern volatile uint16_t RPOR8 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR8BITS {
  union {
    struct {
      uint16_t RP98R:6;
      uint16_t :2;
      uint16_t RP99R:6;
    };
    struct {
      uint16_t RP98R0:1;
      uint16_t RP98R1:1;
      uint16_t RP98R2:1;
      uint16_t RP98R3:1;
      uint16_t RP98R4:1;
      uint16_t RP98R5:1;
      uint16_t :2;
      uint16_t RP99R0:1;
      uint16_t RP99R1:1;
      uint16_t RP99R2:1;
      uint16_t RP99R3:1;
      uint16_t RP99R4:1;
      uint16_t RP99R5:1;
    };
  };
} RPOR8BITS;
extern volatile RPOR8BITS RPOR8bits __attribute__((__sfr__));

