MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP512MC806/mcu.h
#define RPOR9 RPOR9
extern volatile uint16_t RPOR9 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR9BITS {
  union {
    struct {
      uint16_t RP100R:6;
      uint16_t :2;
      uint16_t RP101R:6;
    };
    struct {
      uint16_t RP100R0:1;
      uint16_t RP100R1:1;
      uint16_t RP100R2:1;
      uint16_t RP100R3:1;
      uint16_t RP100R4:1;
      uint16_t RP100R5:1;
      uint16_t :2;
      uint16_t RP101R0:1;
      uint16_t RP101R1:1;
      uint16_t RP101R2:1;
      uint16_t RP101R3:1;
      uint16_t RP101R4:1;
      uint16_t RP101R5:1;
    };
  };
} RPOR9BITS;
extern volatile RPOR9BITS RPOR9bits __attribute__((__sfr__));

#define RPOR10 RPOR10
extern volatile uint16_t RPOR10 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR10BITS {
  union {
    struct {
      uint16_t RP102R:6;
    };
    struct {
      uint16_t RP102R0:1;
      uint16_t RP102R1:1;
      uint16_t RP102R2:1;
      uint16_t RP102R3:1;
      uint16_t RP102R4:1;
      uint16_t RP102R5:1;
    };
  };
} RPOR10BITS;
extern volatile RPOR10BITS RPOR10bits __attribute__((__sfr__));

#define RPOR13 RPOR13
extern volatile uint16_t RPOR13 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR13BITS {
  union {
    struct {
      uint16_t :8;
      uint16_t RP118R:6;
    };
    struct {
      uint16_t :8;
      uint16_t RP118R0:1;
      uint16_t RP118R1:1;
      uint16_t RP118R2:1;
      uint16_t RP118R3:1;
      uint16_t RP118R4:1;
      uint16_t RP118R5:1;
    };
  };
} RPOR13BITS;
extern volatile RPOR13BITS RPOR13bits __attribute__((__sfr__));

#define RPOR14 RPOR14
extern volatile uint16_t RPOR14 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR14BITS {
  union {
    struct {
      uint16_t RP120R:6;
    };
    struct {
      uint16_t RP120R0:1;
      uint16_t RP120R1:1;
      uint16_t RP120R2:1;
      uint16_t RP120R3:1;
      uint16_t RP120R4:1;
      uint16_t RP120R5:1;
    };
  };
} RPOR14BITS;
extern volatile RPOR14BITS RPOR14bits __attribute__((__sfr__));

#define RPINR0 RPINR0
extern volatile uint16_t RPINR0 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR0BITS {
  union {
    struct {
      uint16_t :8;
      uint16_t INT1R:7;
    };
    struct {
      uint16_t :8;
      uint16_t INT1R0:1;
      uint16_t INT1R1:1;
      uint16_t INT1R2:1;
      uint16_t INT1R3:1;
      uint16_t INT1R4:1;
      uint16_t INT1R5:1;
      uint16_t INT1R6:1;
    };
  };
} RPINR0BITS;
extern volatile RPINR0BITS RPINR0bits __attribute__((__sfr__));

#define RPINR1 RPINR1
extern volatile uint16_t RPINR1 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR1BITS {
  union {
    struct {
      uint16_t INT2R:7;
      uint16_t :1;
      uint16_t INT3R:7;
    };
    struct {
      uint16_t INT2R0:1;
      uint16_t INT2R1:1;
      uint16_t INT2R2:1;
      uint16_t INT2R3:1;
      uint16_t INT2R4:1;
      uint16_t INT2R5:1;
      uint16_t INT2R6:1;
      uint16_t :1;
      uint16_t INT3R0:1;
      uint16_t INT3R1:1;
      uint16_t INT3R2:1;
      uint16_t INT3R3:1;
      uint16_t INT3R4:1;
      uint16_t INT3R5:1;
      uint16_t INT3R6:1;
    };
  };
} RPINR1BITS;
extern volatile RPINR1BITS RPINR1bits __attribute__((__sfr__));

#define RPINR2 RPINR2
extern volatile uint16_t RPINR2 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR2BITS {
  union {
    struct {
      uint16_t INT4R:7;
      uint16_t :1;
      uint16_t RSVR:7;
    };
    struct {
      uint16_t INT4R0:1;
      uint16_t INT4R1:1;
      uint16_t INT4R2:1;
      uint16_t INT4R3:1;
      uint16_t INT4R4:1;
      uint16_t INT4R5:1;
      uint16_t INT4R6:1;
      uint16_t :1;
      uint16_t RSVR0:1;
      uint16_t RSVR1:1;
      uint16_t RSVR2:1;
      uint16_t RSVR3:1;
      uint16_t RSVR4:1;
      uint16_t RSVR5:1;
      uint16_t RSVR6:1;
    };
  };
} RPINR2BITS;
extern volatile RPINR2BITS RPINR2bits __attribute__((__sfr__));

#define RPINR3 RPINR3
extern volatile uint16_t RPINR3 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR3BITS {
  union {
    struct {
      uint16_t T2CKR:7;
      uint16_t :1;
      uint16_t T3CKR:7;
    };
    struct {
      uint16_t T2CKR0:1;
      uint16_t T2CKR1:1;
      uint16_t T2CKR2:1;
      uint16_t T2CKR3:1;
      uint16_t T2CKR4:1;
      uint16_t T2CKR5:1;
      uint16_t T2CKR6:1;
      uint16_t :1;
      uint16_t T3CKR0:1;
      uint16_t T3CKR1:1;
      uint16_t T3CKR2:1;
      uint16_t T3CKR3:1;
      uint16_t T3CKR4:1;
      uint16_t T3CKR5:1;
      uint16_t T3CKR6:1;
    };
  };
} RPINR3BITS;
extern volatile RPINR3BITS RPINR3bits __attribute__((__sfr__));

#define RPINR4 RPINR4
extern volatile uint16_t RPINR4 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR4BITS {
  union {
    struct {
      uint16_t T4CKR:7;
      uint16_t :1;
      uint16_t T5CKR:7;
    };
    struct {
      uint16_t T4CKR0:1;
      uint16_t T4CKR1:1;
      uint16_t T4CKR2:1;
      uint16_t T4CKR3:1;
      uint16_t T4CKR4:1;
      uint16_t T4CKR5:1;
      uint16_t T4CKR6:1;
      uint16_t :1;
      uint16_t T5CKR0:1;
      uint16_t T5CKR1:1;
      uint16_t T5CKR2:1;
      uint16_t T5CKR3:1;
      uint16_t T5CKR4:1;
      uint16_t T5CKR5:1;
      uint16_t T5CKR6:1;
    };
  };
} RPINR4BITS;
extern volatile RPINR4BITS RPINR4bits __attribute__((__sfr__));

#define RPINR5 RPINR5
extern volatile uint16_t RPINR5 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR5BITS {
  union {
    struct {
      uint16_t T6CKR:7;
      uint16_t :1;
      uint16_t T7CKR:7;
    };
    struct {
      uint16_t T6CKR0:1;
      uint16_t T6CKR1:1;
      uint16_t T6CKR2:1;
      uint16_t T6CKR3:1;
      uint16_t T6CKR4:1;
      uint16_t T6CKR5:1;
      uint16_t T6CKR6:1;
      uint16_t :1;
      uint16_t T7CKR0:1;
      uint16_t T7CKR1:1;
      uint16_t T7CKR2:1;
      uint16_t T7CKR3:1;
      uint16_t T7CKR4:1;
      uint16_t T7CKR5:1;
      uint16_t T7CKR6:1;
    };
  };
} RPINR5BITS;
extern volatile RPINR5BITS RPINR5bits __attribute__((__sfr__));

#define RPINR6 RPINR6
extern volatile uint16_t RPINR6 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR6BITS {
  union {
    struct {
      uint16_t T8CKR:7;
      uint16_t :1;
      uint16_t T9CKR:7;
    };
    struct {
      uint16_t T8CKR0:1;
      uint16_t T8CKR1:1;
      uint16_t T8CKR2:1;
      uint16_t T8CKR3:1;
      uint16_t T8CKR4:1;
      uint16_t T8CKR5:1;
      uint16_t T8CKR6:1;
      uint16_t :1;
      uint16_t T9CKR0:1;
      uint16_t T9CKR1:1;
      uint16_t T9CKR2:1;
      uint16_t T9CKR3:1;
      uint16_t T9CKR4:1;
      uint16_t T9CKR5:1;
      uint16_t T9CKR6:1;
    };
  };
} RPINR6BITS;
extern volatile RPINR6BITS RPINR6bits __attribute__((__sfr__));

