MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP512MC806/mcu.h
#define _RSCON_RSE4_POSITION                     0x00000004
#define _RSCON_RSE4_MASK                         0x00000010
#define _RSCON_RSE4_LENGTH                       0x00000001

#define _RSCON_RSE5_POSITION                     0x00000005
#define _RSCON_RSE5_MASK                         0x00000020
#define _RSCON_RSE5_LENGTH                       0x00000001

#define _RSCON_RSE6_POSITION                     0x00000006
#define _RSCON_RSE6_MASK                         0x00000040
#define _RSCON_RSE6_LENGTH                       0x00000001

#define _RSCON_RSE7_POSITION                     0x00000007
#define _RSCON_RSE7_MASK                         0x00000080
#define _RSCON_RSE7_LENGTH                       0x00000001

#define _RSCON_RSE8_POSITION                     0x00000008
#define _RSCON_RSE8_MASK                         0x00000100
#define _RSCON_RSE8_LENGTH                       0x00000001

#define _RSCON_RSE9_POSITION                     0x00000009
#define _RSCON_RSE9_MASK                         0x00000200
#define _RSCON_RSE9_LENGTH                       0x00000001

#define _RSCON_RSE10_POSITION                    0x0000000A
#define _RSCON_RSE10_MASK                        0x00000400
#define _RSCON_RSE10_LENGTH                      0x00000001

#define _RSCON_RSE11_POSITION                    0x0000000B
#define _RSCON_RSE11_MASK                        0x00000800
#define _RSCON_RSE11_LENGTH                      0x00000001

#define _RSCON_RSE12_POSITION                    0x0000000C
#define _RSCON_RSE12_MASK                        0x00001000
#define _RSCON_RSE12_LENGTH                      0x00000001

#define _RSCON_RSE13_POSITION                    0x0000000D
#define _RSCON_RSE13_MASK                        0x00002000
#define _RSCON_RSE13_LENGTH                      0x00000001

#define _RSCON_RSE14_POSITION                    0x0000000E
#define _RSCON_RSE14_MASK                        0x00004000
#define _RSCON_RSE14_LENGTH                      0x00000001

#define _RSCON_RSE15_POSITION                    0x0000000F
#define _RSCON_RSE15_MASK                        0x00008000
#define _RSCON_RSE15_LENGTH                      0x00000001

#define _SPI3STAT_SPIRBF_POSITION                0x00000000
#define _SPI3STAT_SPIRBF_MASK                    0x00000001
#define _SPI3STAT_SPIRBF_LENGTH                  0x00000001

#define _SPI3STAT_SPITBF_POSITION                0x00000001
#define _SPI3STAT_SPITBF_MASK                    0x00000002
#define _SPI3STAT_SPITBF_LENGTH                  0x00000001

#define _SPI3STAT_SISEL_POSITION                 0x00000002
#define _SPI3STAT_SISEL_MASK                     0x0000001C
#define _SPI3STAT_SISEL_LENGTH                   0x00000003

#define _SPI3STAT_SRXMPT_POSITION                0x00000005
#define _SPI3STAT_SRXMPT_MASK                    0x00000020
#define _SPI3STAT_SRXMPT_LENGTH                  0x00000001

#define _SPI3STAT_SPIROV_POSITION                0x00000006
#define _SPI3STAT_SPIROV_MASK                    0x00000040
#define _SPI3STAT_SPIROV_LENGTH                  0x00000001

#define _SPI3STAT_SRMPT_POSITION                 0x00000007
#define _SPI3STAT_SRMPT_MASK                     0x00000080
#define _SPI3STAT_SRMPT_LENGTH                   0x00000001

#define _SPI3STAT_SPIBEC_POSITION                0x00000008
#define _SPI3STAT_SPIBEC_MASK                    0x00000700
#define _SPI3STAT_SPIBEC_LENGTH                  0x00000003

#define _SPI3STAT_SPISIDL_POSITION               0x0000000D
#define _SPI3STAT_SPISIDL_MASK                   0x00002000
#define _SPI3STAT_SPISIDL_LENGTH                 0x00000001

#define _SPI3STAT_SPIEN_POSITION                 0x0000000F
#define _SPI3STAT_SPIEN_MASK                     0x00008000
#define _SPI3STAT_SPIEN_LENGTH                   0x00000001

#define _SPI3STAT_SISEL0_POSITION                0x00000002
#define _SPI3STAT_SISEL0_MASK                    0x00000004
#define _SPI3STAT_SISEL0_LENGTH                  0x00000001

#define _SPI3STAT_SISEL1_POSITION                0x00000003
#define _SPI3STAT_SISEL1_MASK                    0x00000008
#define _SPI3STAT_SISEL1_LENGTH                  0x00000001

#define _SPI3STAT_SISEL2_POSITION                0x00000004
#define _SPI3STAT_SISEL2_MASK                    0x00000010
#define _SPI3STAT_SISEL2_LENGTH                  0x00000001

#define _SPI3STAT_SPIBEC0_POSITION               0x00000008
#define _SPI3STAT_SPIBEC0_MASK                   0x00000100
#define _SPI3STAT_SPIBEC0_LENGTH                 0x00000001

#define _SPI3STAT_SPIBEC1_POSITION               0x00000009
#define _SPI3STAT_SPIBEC1_MASK                   0x00000200
#define _SPI3STAT_SPIBEC1_LENGTH                 0x00000001

#define _SPI3STAT_SPIBEC2_POSITION               0x0000000A
#define _SPI3STAT_SPIBEC2_MASK                   0x00000400
#define _SPI3STAT_SPIBEC2_LENGTH                 0x00000001

#define _SPI3CON1_PPRE_POSITION                  0x00000000
#define _SPI3CON1_PPRE_MASK                      0x00000003
#define _SPI3CON1_PPRE_LENGTH                    0x00000002

#define _SPI3CON1_SPRE_POSITION                  0x00000002
#define _SPI3CON1_SPRE_MASK                      0x0000001C
#define _SPI3CON1_SPRE_LENGTH                    0x00000003

#define _SPI3CON1_MSTEN_POSITION                 0x00000005
#define _SPI3CON1_MSTEN_MASK                     0x00000020
#define _SPI3CON1_MSTEN_LENGTH                   0x00000001

#define _SPI3CON1_CKP_POSITION                   0x00000006
#define _SPI3CON1_CKP_MASK                       0x00000040
#define _SPI3CON1_CKP_LENGTH                     0x00000001

#define _SPI3CON1_SSEN_POSITION                  0x00000007
#define _SPI3CON1_SSEN_MASK                      0x00000080
#define _SPI3CON1_SSEN_LENGTH                    0x00000001

#define _SPI3CON1_CKE_POSITION                   0x00000008
#define _SPI3CON1_CKE_MASK                       0x00000100
#define _SPI3CON1_CKE_LENGTH                     0x00000001

#define _SPI3CON1_SMP_POSITION                   0x00000009
#define _SPI3CON1_SMP_MASK                       0x00000200
#define _SPI3CON1_SMP_LENGTH                     0x00000001

#define _SPI3CON1_MODE16_POSITION                0x0000000A
#define _SPI3CON1_MODE16_MASK                    0x00000400
#define _SPI3CON1_MODE16_LENGTH                  0x00000001

