MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP512MC806/mcu.h
#define _PMD3_T7MD_POSITION                      0x0000000D
#define _PMD3_T7MD_MASK                          0x00002000
#define _PMD3_T7MD_LENGTH                        0x00000001

#define _PMD3_T8MD_POSITION                      0x0000000E
#define _PMD3_T8MD_MASK                          0x00004000
#define _PMD3_T8MD_LENGTH                        0x00000001

#define _PMD3_T9MD_POSITION                      0x0000000F
#define _PMD3_T9MD_MASK                          0x00008000
#define _PMD3_T9MD_LENGTH                        0x00000001

#define _PMD4_REFOMD_POSITION                    0x00000003
#define _PMD4_REFOMD_MASK                        0x00000008
#define _PMD4_REFOMD_LENGTH                      0x00000001

#define _PMD4_U4MD_POSITION                      0x00000005
#define _PMD4_U4MD_MASK                          0x00000020
#define _PMD4_U4MD_LENGTH                        0x00000001

#define _PMD5_OC9MD_POSITION                     0x00000000
#define _PMD5_OC9MD_MASK                         0x00000001
#define _PMD5_OC9MD_LENGTH                       0x00000001

#define _PMD5_OC10MD_POSITION                    0x00000001
#define _PMD5_OC10MD_MASK                        0x00000002
#define _PMD5_OC10MD_LENGTH                      0x00000001

#define _PMD5_OC11MD_POSITION                    0x00000002
#define _PMD5_OC11MD_MASK                        0x00000004
#define _PMD5_OC11MD_LENGTH                      0x00000001

#define _PMD5_OC12MD_POSITION                    0x00000003
#define _PMD5_OC12MD_MASK                        0x00000008
#define _PMD5_OC12MD_LENGTH                      0x00000001

#define _PMD5_OC13MD_POSITION                    0x00000004
#define _PMD5_OC13MD_MASK                        0x00000010
#define _PMD5_OC13MD_LENGTH                      0x00000001

#define _PMD5_OC14MD_POSITION                    0x00000005
#define _PMD5_OC14MD_MASK                        0x00000020
#define _PMD5_OC14MD_LENGTH                      0x00000001

#define _PMD5_OC15MD_POSITION                    0x00000006
#define _PMD5_OC15MD_MASK                        0x00000040
#define _PMD5_OC15MD_LENGTH                      0x00000001

#define _PMD5_OC16MD_POSITION                    0x00000007
#define _PMD5_OC16MD_MASK                        0x00000080
#define _PMD5_OC16MD_LENGTH                      0x00000001

#define _PMD5_IC9MD_POSITION                     0x00000008
#define _PMD5_IC9MD_MASK                         0x00000100
#define _PMD5_IC9MD_LENGTH                       0x00000001

#define _PMD5_IC10MD_POSITION                    0x00000009
#define _PMD5_IC10MD_MASK                        0x00000200
#define _PMD5_IC10MD_LENGTH                      0x00000001

#define _PMD5_IC11MD_POSITION                    0x0000000A
#define _PMD5_IC11MD_MASK                        0x00000400
#define _PMD5_IC11MD_LENGTH                      0x00000001

#define _PMD5_IC12MD_POSITION                    0x0000000B
#define _PMD5_IC12MD_MASK                        0x00000800
#define _PMD5_IC12MD_LENGTH                      0x00000001

#define _PMD5_IC13MD_POSITION                    0x0000000C
#define _PMD5_IC13MD_MASK                        0x00001000
#define _PMD5_IC13MD_LENGTH                      0x00000001

#define _PMD5_IC14MD_POSITION                    0x0000000D
#define _PMD5_IC14MD_MASK                        0x00002000
#define _PMD5_IC14MD_LENGTH                      0x00000001

#define _PMD5_IC15MD_POSITION                    0x0000000E
#define _PMD5_IC15MD_MASK                        0x00004000
#define _PMD5_IC15MD_LENGTH                      0x00000001

#define _PMD5_IC16MD_POSITION                    0x0000000F
#define _PMD5_IC16MD_MASK                        0x00008000
#define _PMD5_IC16MD_LENGTH                      0x00000001

#define _PMD6_SPI3MD_POSITION                    0x00000000
#define _PMD6_SPI3MD_MASK                        0x00000001
#define _PMD6_SPI3MD_LENGTH                      0x00000001

#define _PMD6_SPI4MD_POSITION                    0x00000001
#define _PMD6_SPI4MD_MASK                        0x00000002
#define _PMD6_SPI4MD_LENGTH                      0x00000001

#define _PMD6_PWM1MD_POSITION                    0x00000008
#define _PMD6_PWM1MD_MASK                        0x00000100
#define _PMD6_PWM1MD_LENGTH                      0x00000001

#define _PMD6_PWM2MD_POSITION                    0x00000009
#define _PMD6_PWM2MD_MASK                        0x00000200
#define _PMD6_PWM2MD_LENGTH                      0x00000001

#define _PMD6_PWM3MD_POSITION                    0x0000000A
#define _PMD6_PWM3MD_MASK                        0x00000400
#define _PMD6_PWM3MD_LENGTH                      0x00000001

#define _PMD6_PWM4MD_POSITION                    0x0000000B
#define _PMD6_PWM4MD_MASK                        0x00000800
#define _PMD6_PWM4MD_LENGTH                      0x00000001

#define _PMD7_DMA0MD_POSITION                    0x00000004
#define _PMD7_DMA0MD_MASK                        0x00000010
#define _PMD7_DMA0MD_LENGTH                      0x00000001

#define _PMD7_DMA4MD_POSITION                    0x00000005
#define _PMD7_DMA4MD_MASK                        0x00000020
#define _PMD7_DMA4MD_LENGTH                      0x00000001

#define _PMD7_DMA8MD_POSITION                    0x00000006
#define _PMD7_DMA8MD_MASK                        0x00000040
#define _PMD7_DMA8MD_LENGTH                      0x00000001

#define _PMD7_DMA12MD_POSITION                   0x00000007
#define _PMD7_DMA12MD_MASK                       0x00000080
#define _PMD7_DMA12MD_LENGTH                     0x00000001

#define _PMD7_DMA1MD_POSITION                    0x00000004
#define _PMD7_DMA1MD_MASK                        0x00000010
#define _PMD7_DMA1MD_LENGTH                      0x00000001

#define _PMD7_DMA5MD_POSITION                    0x00000005
#define _PMD7_DMA5MD_MASK                        0x00000020
#define _PMD7_DMA5MD_LENGTH                      0x00000001

#define _PMD7_DMA9MD_POSITION                    0x00000006
#define _PMD7_DMA9MD_MASK                        0x00000040
#define _PMD7_DMA9MD_LENGTH                      0x00000001

#define _PMD7_DMA13MD_POSITION                   0x00000007
#define _PMD7_DMA13MD_MASK                       0x00000080
#define _PMD7_DMA13MD_LENGTH                     0x00000001

#define _PMD7_DMA2MD_POSITION                    0x00000004
#define _PMD7_DMA2MD_MASK                        0x00000010
#define _PMD7_DMA2MD_LENGTH                      0x00000001

#define _PMD7_DMA6MD_POSITION                    0x00000005
#define _PMD7_DMA6MD_MASK                        0x00000020
#define _PMD7_DMA6MD_LENGTH                      0x00000001

#define _PMD7_DMA10MD_POSITION                   0x00000006
#define _PMD7_DMA10MD_MASK                       0x00000040
#define _PMD7_DMA10MD_LENGTH                     0x00000001

#define _PMD7_DMA14MD_POSITION                   0x00000007
#define _PMD7_DMA14MD_MASK                       0x00000080
#define _PMD7_DMA14MD_LENGTH                     0x00000001

#define _PMD7_DMA3MD_POSITION                    0x00000004
#define _PMD7_DMA3MD_MASK                        0x00000010
#define _PMD7_DMA3MD_LENGTH                      0x00000001

