MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP512MC806/mcu.h
#define _IEC5_U3TXIE_POSITION                    0x00000003
#define _IEC5_U3TXIE_MASK                        0x00000008
#define _IEC5_U3TXIE_LENGTH                      0x00000001

#define _IEC5_U4EIE_POSITION                     0x00000007
#define _IEC5_U4EIE_MASK                         0x00000080
#define _IEC5_U4EIE_LENGTH                       0x00000001

#define _IEC5_U4RXIE_POSITION                    0x00000008
#define _IEC5_U4RXIE_MASK                        0x00000100
#define _IEC5_U4RXIE_LENGTH                      0x00000001

#define _IEC5_U4TXIE_POSITION                    0x00000009
#define _IEC5_U4TXIE_MASK                        0x00000200
#define _IEC5_U4TXIE_LENGTH                      0x00000001

#define _IEC5_SPI3EIE_POSITION                   0x0000000A
#define _IEC5_SPI3EIE_MASK                       0x00000400
#define _IEC5_SPI3EIE_LENGTH                     0x00000001

#define _IEC5_SPI3IE_POSITION                    0x0000000B
#define _IEC5_SPI3IE_MASK                        0x00000800
#define _IEC5_SPI3IE_LENGTH                      0x00000001

#define _IEC5_OC9IE_POSITION                     0x0000000C
#define _IEC5_OC9IE_MASK                         0x00001000
#define _IEC5_OC9IE_LENGTH                       0x00000001

#define _IEC5_IC9IE_POSITION                     0x0000000D
#define _IEC5_IC9IE_MASK                         0x00002000
#define _IEC5_IC9IE_LENGTH                       0x00000001

#define _IEC5_PWM1IE_POSITION                    0x0000000E
#define _IEC5_PWM1IE_MASK                        0x00004000
#define _IEC5_PWM1IE_LENGTH                      0x00000001

#define _IEC5_PWM2IE_POSITION                    0x0000000F
#define _IEC5_PWM2IE_MASK                        0x00008000
#define _IEC5_PWM2IE_LENGTH                      0x00000001

#define _IEC6_PWM3IE_POSITION                    0x00000000
#define _IEC6_PWM3IE_MASK                        0x00000001
#define _IEC6_PWM3IE_LENGTH                      0x00000001

#define _IEC6_PWM4IE_POSITION                    0x00000001
#define _IEC6_PWM4IE_MASK                        0x00000002
#define _IEC6_PWM4IE_LENGTH                      0x00000001

#define _IEC7_DMA8IE_POSITION                    0x00000006
#define _IEC7_DMA8IE_MASK                        0x00000040
#define _IEC7_DMA8IE_LENGTH                      0x00000001

#define _IEC7_DMA9IE_POSITION                    0x00000007
#define _IEC7_DMA9IE_MASK                        0x00000080
#define _IEC7_DMA9IE_LENGTH                      0x00000001

#define _IEC7_DMA10IE_POSITION                   0x00000008
#define _IEC7_DMA10IE_MASK                       0x00000100
#define _IEC7_DMA10IE_LENGTH                     0x00000001

#define _IEC7_DMA11IE_POSITION                   0x00000009
#define _IEC7_DMA11IE_MASK                       0x00000200
#define _IEC7_DMA11IE_LENGTH                     0x00000001

#define _IEC7_SPI4EIE_POSITION                   0x0000000A
#define _IEC7_SPI4EIE_MASK                       0x00000400
#define _IEC7_SPI4EIE_LENGTH                     0x00000001

#define _IEC7_SPI4IE_POSITION                    0x0000000B
#define _IEC7_SPI4IE_MASK                        0x00000800
#define _IEC7_SPI4IE_LENGTH                      0x00000001

#define _IEC7_OC10IE_POSITION                    0x0000000C
#define _IEC7_OC10IE_MASK                        0x00001000
#define _IEC7_OC10IE_LENGTH                      0x00000001

#define _IEC7_IC10IE_POSITION                    0x0000000D
#define _IEC7_IC10IE_MASK                        0x00002000
#define _IEC7_IC10IE_LENGTH                      0x00000001

#define _IEC7_OC11IE_POSITION                    0x0000000E
#define _IEC7_OC11IE_MASK                        0x00004000
#define _IEC7_OC11IE_LENGTH                      0x00000001

#define _IEC7_IC11IE_POSITION                    0x0000000F
#define _IEC7_IC11IE_MASK                        0x00008000
#define _IEC7_IC11IE_LENGTH                      0x00000001

#define _IEC8_OC12IE_POSITION                    0x00000000
#define _IEC8_OC12IE_MASK                        0x00000001
#define _IEC8_OC12IE_LENGTH                      0x00000001

#define _IEC8_IC12IE_POSITION                    0x00000001
#define _IEC8_IC12IE_MASK                        0x00000002
#define _IEC8_IC12IE_LENGTH                      0x00000001

#define _IEC8_DMA12IE_POSITION                   0x00000002
#define _IEC8_DMA12IE_MASK                       0x00000004
#define _IEC8_DMA12IE_LENGTH                     0x00000001

#define _IEC8_DMA13IE_POSITION                   0x00000003
#define _IEC8_DMA13IE_MASK                       0x00000008
#define _IEC8_DMA13IE_LENGTH                     0x00000001

#define _IEC8_DMA14IE_POSITION                   0x00000004
#define _IEC8_DMA14IE_MASK                       0x00000010
#define _IEC8_DMA14IE_LENGTH                     0x00000001

#define _IEC8_OC13IE_POSITION                    0x00000006
#define _IEC8_OC13IE_MASK                        0x00000040
#define _IEC8_OC13IE_LENGTH                      0x00000001

#define _IEC8_IC13IE_POSITION                    0x00000007
#define _IEC8_IC13IE_MASK                        0x00000080
#define _IEC8_IC13IE_LENGTH                      0x00000001

#define _IEC8_OC14IE_POSITION                    0x00000008
#define _IEC8_OC14IE_MASK                        0x00000100
#define _IEC8_OC14IE_LENGTH                      0x00000001

#define _IEC8_IC14IE_POSITION                    0x00000009
#define _IEC8_IC14IE_MASK                        0x00000200
#define _IEC8_IC14IE_LENGTH                      0x00000001

#define _IEC8_OC15IE_POSITION                    0x0000000A
#define _IEC8_OC15IE_MASK                        0x00000400
#define _IEC8_OC15IE_LENGTH                      0x00000001

#define _IEC8_IC15IE_POSITION                    0x0000000B
#define _IEC8_IC15IE_MASK                        0x00000800
#define _IEC8_IC15IE_LENGTH                      0x00000001

#define _IEC8_OC16IE_POSITION                    0x0000000C
#define _IEC8_OC16IE_MASK                        0x00001000
#define _IEC8_OC16IE_LENGTH                      0x00000001

