MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP512MC806/mcu.h
#define _IPC31_OC10IP0_POSITION                  0x00000000
#define _IPC31_OC10IP0_MASK                      0x00000001
#define _IPC31_OC10IP0_LENGTH                    0x00000001

#define _IPC31_OC10IP1_POSITION                  0x00000001
#define _IPC31_OC10IP1_MASK                      0x00000002
#define _IPC31_OC10IP1_LENGTH                    0x00000001

#define _IPC31_OC10IP2_POSITION                  0x00000002
#define _IPC31_OC10IP2_MASK                      0x00000004
#define _IPC31_OC10IP2_LENGTH                    0x00000001

#define _IPC31_IC10IP0_POSITION                  0x00000004
#define _IPC31_IC10IP0_MASK                      0x00000010
#define _IPC31_IC10IP0_LENGTH                    0x00000001

#define _IPC31_IC10IP1_POSITION                  0x00000005
#define _IPC31_IC10IP1_MASK                      0x00000020
#define _IPC31_IC10IP1_LENGTH                    0x00000001

#define _IPC31_IC10IP2_POSITION                  0x00000006
#define _IPC31_IC10IP2_MASK                      0x00000040
#define _IPC31_IC10IP2_LENGTH                    0x00000001

#define _IPC31_OC11IP0_POSITION                  0x00000008
#define _IPC31_OC11IP0_MASK                      0x00000100
#define _IPC31_OC11IP0_LENGTH                    0x00000001

#define _IPC31_OC11IP1_POSITION                  0x00000009
#define _IPC31_OC11IP1_MASK                      0x00000200
#define _IPC31_OC11IP1_LENGTH                    0x00000001

#define _IPC31_OC11IP2_POSITION                  0x0000000A
#define _IPC31_OC11IP2_MASK                      0x00000400
#define _IPC31_OC11IP2_LENGTH                    0x00000001

#define _IPC31_IC11IP0_POSITION                  0x0000000C
#define _IPC31_IC11IP0_MASK                      0x00001000
#define _IPC31_IC11IP0_LENGTH                    0x00000001

#define _IPC31_IC11IP1_POSITION                  0x0000000D
#define _IPC31_IC11IP1_MASK                      0x00002000
#define _IPC31_IC11IP1_LENGTH                    0x00000001

#define _IPC31_IC11IP2_POSITION                  0x0000000E
#define _IPC31_IC11IP2_MASK                      0x00004000
#define _IPC31_IC11IP2_LENGTH                    0x00000001

#define _IPC32_OC12IP_POSITION                   0x00000000
#define _IPC32_OC12IP_MASK                       0x00000007
#define _IPC32_OC12IP_LENGTH                     0x00000003

#define _IPC32_IC12IP_POSITION                   0x00000004
#define _IPC32_IC12IP_MASK                       0x00000070
#define _IPC32_IC12IP_LENGTH                     0x00000003

#define _IPC32_DMA12IP_POSITION                  0x00000008
#define _IPC32_DMA12IP_MASK                      0x00000700
#define _IPC32_DMA12IP_LENGTH                    0x00000003

#define _IPC32_DMA13IP_POSITION                  0x0000000C
#define _IPC32_DMA13IP_MASK                      0x00007000
#define _IPC32_DMA13IP_LENGTH                    0x00000003

#define _IPC32_OC12IP0_POSITION                  0x00000000
#define _IPC32_OC12IP0_MASK                      0x00000001
#define _IPC32_OC12IP0_LENGTH                    0x00000001

#define _IPC32_OC12IP1_POSITION                  0x00000001
#define _IPC32_OC12IP1_MASK                      0x00000002
#define _IPC32_OC12IP1_LENGTH                    0x00000001

#define _IPC32_OC12IP2_POSITION                  0x00000002
#define _IPC32_OC12IP2_MASK                      0x00000004
#define _IPC32_OC12IP2_LENGTH                    0x00000001

#define _IPC32_IC12IP0_POSITION                  0x00000004
#define _IPC32_IC12IP0_MASK                      0x00000010
#define _IPC32_IC12IP0_LENGTH                    0x00000001

#define _IPC32_IC12IP1_POSITION                  0x00000005
#define _IPC32_IC12IP1_MASK                      0x00000020
#define _IPC32_IC12IP1_LENGTH                    0x00000001

#define _IPC32_IC12IP2_POSITION                  0x00000006
#define _IPC32_IC12IP2_MASK                      0x00000040
#define _IPC32_IC12IP2_LENGTH                    0x00000001

#define _IPC32_DMA12IP0_POSITION                 0x00000008
#define _IPC32_DMA12IP0_MASK                     0x00000100
#define _IPC32_DMA12IP0_LENGTH                   0x00000001

#define _IPC32_DMA12IP1_POSITION                 0x00000009
#define _IPC32_DMA12IP1_MASK                     0x00000200
#define _IPC32_DMA12IP1_LENGTH                   0x00000001

#define _IPC32_DMA12IP2_POSITION                 0x0000000A
#define _IPC32_DMA12IP2_MASK                     0x00000400
#define _IPC32_DMA12IP2_LENGTH                   0x00000001

#define _IPC32_DMA13IP0_POSITION                 0x0000000C
#define _IPC32_DMA13IP0_MASK                     0x00001000
#define _IPC32_DMA13IP0_LENGTH                   0x00000001

#define _IPC32_DMA13IP1_POSITION                 0x0000000D
#define _IPC32_DMA13IP1_MASK                     0x00002000
#define _IPC32_DMA13IP1_LENGTH                   0x00000001

#define _IPC32_DMA13IP2_POSITION                 0x0000000E
#define _IPC32_DMA13IP2_MASK                     0x00004000
#define _IPC32_DMA13IP2_LENGTH                   0x00000001

#define _IPC33_DMA14IP_POSITION                  0x00000000
#define _IPC33_DMA14IP_MASK                      0x00000007
#define _IPC33_DMA14IP_LENGTH                    0x00000003

#define _IPC33_OC13IP_POSITION                   0x00000008
#define _IPC33_OC13IP_MASK                       0x00000700
#define _IPC33_OC13IP_LENGTH                     0x00000003

#define _IPC33_IC13IP_POSITION                   0x0000000C
#define _IPC33_IC13IP_MASK                       0x00007000
#define _IPC33_IC13IP_LENGTH                     0x00000003

#define _IPC33_DMA14IP0_POSITION                 0x00000000
#define _IPC33_DMA14IP0_MASK                     0x00000001
#define _IPC33_DMA14IP0_LENGTH                   0x00000001

#define _IPC33_DMA14IP1_POSITION                 0x00000001
#define _IPC33_DMA14IP1_MASK                     0x00000002
#define _IPC33_DMA14IP1_LENGTH                   0x00000001

#define _IPC33_DMA14IP2_POSITION                 0x00000002
#define _IPC33_DMA14IP2_MASK                     0x00000004
#define _IPC33_DMA14IP2_LENGTH                   0x00000001

#define _IPC33_OC13IP0_POSITION                  0x00000008
#define _IPC33_OC13IP0_MASK                      0x00000100
#define _IPC33_OC13IP0_LENGTH                    0x00000001

#define _IPC33_OC13IP1_POSITION                  0x00000009
#define _IPC33_OC13IP1_MASK                      0x00000200
#define _IPC33_OC13IP1_LENGTH                    0x00000001

#define _IPC33_OC13IP2_POSITION                  0x0000000A
#define _IPC33_OC13IP2_MASK                      0x00000400
#define _IPC33_OC13IP2_LENGTH                    0x00000001

#define _IPC33_IC13IP0_POSITION                  0x0000000C
#define _IPC33_IC13IP0_MASK                      0x00001000
#define _IPC33_IC13IP0_LENGTH                    0x00000001

#define _IPC33_IC13IP1_POSITION                  0x0000000D
#define _IPC33_IC13IP1_MASK                      0x00002000
#define _IPC33_IC13IP1_LENGTH                    0x00000001

#define _IPC33_IC13IP2_POSITION                  0x0000000E
#define _IPC33_IC13IP2_MASK                      0x00004000
#define _IPC33_IC13IP2_LENGTH                    0x00000001

#define _IPC34_OC14IP_POSITION                   0x00000000
#define _IPC34_OC14IP_MASK                       0x00000007
#define _IPC34_OC14IP_LENGTH                     0x00000003

#define _IPC34_IC14IP_POSITION                   0x00000004
#define _IPC34_IC14IP_MASK                       0x00000070
#define _IPC34_IC14IP_LENGTH                     0x00000003

#define _IPC34_OC15IP_POSITION                   0x00000008
#define _IPC34_OC15IP_MASK                       0x00000700
#define _IPC34_OC15IP_LENGTH                     0x00000003

#define _IPC34_IC15IP_POSITION                   0x0000000C
#define _IPC34_IC15IP_MASK                       0x00007000
#define _IPC34_IC15IP_LENGTH                     0x00000003

