MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP512MC806/mcu.h
#define _IPC34_OC14IP0_POSITION                  0x00000000
#define _IPC34_OC14IP0_MASK                      0x00000001
#define _IPC34_OC14IP0_LENGTH                    0x00000001

#define _IPC34_OC14IP1_POSITION                  0x00000001
#define _IPC34_OC14IP1_MASK                      0x00000002
#define _IPC34_OC14IP1_LENGTH                    0x00000001

#define _IPC34_OC14IP2_POSITION                  0x00000002
#define _IPC34_OC14IP2_MASK                      0x00000004
#define _IPC34_OC14IP2_LENGTH                    0x00000001

#define _IPC34_IC14IP0_POSITION                  0x00000004
#define _IPC34_IC14IP0_MASK                      0x00000010
#define _IPC34_IC14IP0_LENGTH                    0x00000001

#define _IPC34_IC14IP1_POSITION                  0x00000005
#define _IPC34_IC14IP1_MASK                      0x00000020
#define _IPC34_IC14IP1_LENGTH                    0x00000001

#define _IPC34_IC14IP2_POSITION                  0x00000006
#define _IPC34_IC14IP2_MASK                      0x00000040
#define _IPC34_IC14IP2_LENGTH                    0x00000001

#define _IPC34_OC15IP0_POSITION                  0x00000008
#define _IPC34_OC15IP0_MASK                      0x00000100
#define _IPC34_OC15IP0_LENGTH                    0x00000001

#define _IPC34_OC15IP1_POSITION                  0x00000009
#define _IPC34_OC15IP1_MASK                      0x00000200
#define _IPC34_OC15IP1_LENGTH                    0x00000001

#define _IPC34_OC15IP2_POSITION                  0x0000000A
#define _IPC34_OC15IP2_MASK                      0x00000400
#define _IPC34_OC15IP2_LENGTH                    0x00000001

#define _IPC34_IC15IP0_POSITION                  0x0000000C
#define _IPC34_IC15IP0_MASK                      0x00001000
#define _IPC34_IC15IP0_LENGTH                    0x00000001

#define _IPC34_IC15IP1_POSITION                  0x0000000D
#define _IPC34_IC15IP1_MASK                      0x00002000
#define _IPC34_IC15IP1_LENGTH                    0x00000001

#define _IPC34_IC15IP2_POSITION                  0x0000000E
#define _IPC34_IC15IP2_MASK                      0x00004000
#define _IPC34_IC15IP2_LENGTH                    0x00000001

#define _IPC35_OC16IP_POSITION                   0x00000000
#define _IPC35_OC16IP_MASK                       0x00000007
#define _IPC35_OC16IP_LENGTH                     0x00000003

#define _IPC35_IC16IP_POSITION                   0x00000004
#define _IPC35_IC16IP_MASK                       0x00000070
#define _IPC35_IC16IP_LENGTH                     0x00000003

#define _IPC35_ICDIP_POSITION                    0x00000008
#define _IPC35_ICDIP_MASK                        0x00000700
#define _IPC35_ICDIP_LENGTH                      0x00000003

#define _IPC35_OC16IP0_POSITION                  0x00000000
#define _IPC35_OC16IP0_MASK                      0x00000001
#define _IPC35_OC16IP0_LENGTH                    0x00000001

#define _IPC35_OC16IP1_POSITION                  0x00000001
#define _IPC35_OC16IP1_MASK                      0x00000002
#define _IPC35_OC16IP1_LENGTH                    0x00000001

#define _IPC35_OC16IP2_POSITION                  0x00000002
#define _IPC35_OC16IP2_MASK                      0x00000004
#define _IPC35_OC16IP2_LENGTH                    0x00000001

#define _IPC35_IC16IP0_POSITION                  0x00000004
#define _IPC35_IC16IP0_MASK                      0x00000010
#define _IPC35_IC16IP0_LENGTH                    0x00000001

#define _IPC35_IC16IP1_POSITION                  0x00000005
#define _IPC35_IC16IP1_MASK                      0x00000020
#define _IPC35_IC16IP1_LENGTH                    0x00000001

#define _IPC35_IC16IP2_POSITION                  0x00000006
#define _IPC35_IC16IP2_MASK                      0x00000040
#define _IPC35_IC16IP2_LENGTH                    0x00000001

#define _IPC35_ICDIP0_POSITION                   0x00000008
#define _IPC35_ICDIP0_MASK                       0x00000100
#define _IPC35_ICDIP0_LENGTH                     0x00000001

#define _IPC35_ICDIP1_POSITION                   0x00000009
#define _IPC35_ICDIP1_MASK                       0x00000200
#define _IPC35_ICDIP1_LENGTH                     0x00000001

#define _IPC35_ICDIP2_POSITION                   0x0000000A
#define _IPC35_ICDIP2_MASK                       0x00000400
#define _IPC35_ICDIP2_LENGTH                     0x00000001

#define _INTCON1_OSCFAIL_POSITION                0x00000001
#define _INTCON1_OSCFAIL_MASK                    0x00000002
#define _INTCON1_OSCFAIL_LENGTH                  0x00000001

#define _INTCON1_STKERR_POSITION                 0x00000002
#define _INTCON1_STKERR_MASK                     0x00000004
#define _INTCON1_STKERR_LENGTH                   0x00000001

#define _INTCON1_ADDRERR_POSITION                0x00000003
#define _INTCON1_ADDRERR_MASK                    0x00000008
#define _INTCON1_ADDRERR_LENGTH                  0x00000001

#define _INTCON1_MATHERR_POSITION                0x00000004
#define _INTCON1_MATHERR_MASK                    0x00000010
#define _INTCON1_MATHERR_LENGTH                  0x00000001

#define _INTCON1_DMACERR_POSITION                0x00000005
#define _INTCON1_DMACERR_MASK                    0x00000020
#define _INTCON1_DMACERR_LENGTH                  0x00000001

#define _INTCON1_DIV0ERR_POSITION                0x00000006
#define _INTCON1_DIV0ERR_MASK                    0x00000040
#define _INTCON1_DIV0ERR_LENGTH                  0x00000001

#define _INTCON1_SFTACERR_POSITION               0x00000007
#define _INTCON1_SFTACERR_MASK                   0x00000080
#define _INTCON1_SFTACERR_LENGTH                 0x00000001

#define _INTCON1_COVTE_POSITION                  0x00000008
#define _INTCON1_COVTE_MASK                      0x00000100
#define _INTCON1_COVTE_LENGTH                    0x00000001

#define _INTCON1_OVBTE_POSITION                  0x00000009
#define _INTCON1_OVBTE_MASK                      0x00000200
#define _INTCON1_OVBTE_LENGTH                    0x00000001

#define _INTCON1_OVATE_POSITION                  0x0000000A
#define _INTCON1_OVATE_MASK                      0x00000400
#define _INTCON1_OVATE_LENGTH                    0x00000001

